

TOKEN_EXPIRATION = 30 * 24 * 3600
# 令牌有效期1个月

# PER_PAGE = 15
# 单页15项

VIEW_TYPE = {
    '1': 'total_houses',
    '2': 'sold_houses',
    '3': 'unsold_houses',
    '4': 'sold_rate',
    '5': 'houses_average'
}

LAND_VIEW_TYPE = {
    '1': "listing_floor_price",
    '2': "transfer_floor_price"
}

LAND_REGION = {
    "1": "全选",
    "2": '温州市(本级)',
    "3": '苍南县',
    "4": '平阳县',
    "5": '瑞安市',
    "6": '乐清市',
    "7": '洞头区',
    "8": '永嘉县',
    "9": '泰顺县',
    "10": '文成县'
}

LAND_USAGE_TYPE = {
    "1": "全选",
    "2": '普通商品住房用地',
    "3": '标准厂房',
    "4": '其他工业用地',
    "5": '批发零售用地',
    "6": '非养老服务用地',
    "7": '零售商业用地',
    "8": '文体娱乐用地',
    "9": '住宿餐饮用地',
    "10": '养老服务用地',
    "11": '工业用地(其他工业用地)',
    "12": '通用仓储类',
    "13": '公共设施用地',
    "14": '科教用地',
    "15": '街巷用地',
    "16": '殡葬用地',
    "17": '商务金融用地',
    "18": '城镇住宅用地(普通商品房)',
    "19": '旅馆用地',
    "20": '文化设施用地',
    "21": '公路用地',
    "22": '公用设施用地',
    "23": '工业用地(标准厂房)',
    "24": '教育用地',
    "25": '其他商服用地(其他非养老机构用地)',
    "26": '社会福利用地',
    "27": '娱乐用地',
    "28": '港口码头用地',
    "29": '医卫慈善用地'
}

LAND_BLOCK_STATUS = {
    "1": "全选",
    "2": '挂牌出让【终止】',
    "3": '挂牌出让【未成交】',
    "4": '挂牌出让【成交】',
    "5": '挂牌出让【交易结束】',
    "6": '拍卖出让【终止】',
    "7": '拍卖出让【未成交】',
    "8": '拍卖出让【成交】',
    "9": '挂牌出让【发布公告】',
    "10": '挂牌出让【挂牌期】',
    "11": '拍卖出让【发布公告】',
    "12": '拍卖出让【交易结束】'
}

HIST_REGION = {
    "1": "全选",
    "2": '鹿城区',
    "3": '龙湾区',
    "4": '瓯海区',
    "5": '经济技术开发区',
    "6": '洞头区',
    "7": '瑞安市',
    "8": '乐清市',
    "9": '永嘉县',
    "10": '平阳县',
    "11": '苍南县',
    "12": '文成县',
    "13": '泰顺县',
    "14": '龙港市'
}

HIST_SEARCH_ATTRI = [
    "building_promotion_name",
    "building_name",
    "presale_license_number",
    "building_address"
]

SINGLEROOM_ORDER = {
    '1': "overall_floorage",
    '2': "room_price",
    '3': "total_price",
    '4': "sold_date",
    '5': "build_name",
    '6': "room_number",
    '7': "state"
}

HISTSUP_ORDER = {
    '1': "sold_rate",
    '2': "houses_average",
    '3': "commercial_average"
}

LAND_ORDER = {
    '1': "price",
    '2': "total_land_area"
}

ORDER_AD = {
    '1': "desc",
    '0': "asc"
}

LAND_FILE_TYPE = {
    '1': "出让公告",
    '2': "出让须知",
    '3': "宗地界址图",
    '4': "宗地规划指标要求",
    '5': "成交确认书",
    '6': "国有建设用地使用权出让合同"
}
